#ifndef MMM_FONTPOOL_HPP
#define MMM_FONTPOOL_HPP

#include <freetype/freetype.h>

#include <QOpenGLFunctions_4_1_Core>
#include <atomic>
#include <glm/fwd.hpp>
#include <ice/thread/ThreadPool.hpp>
#include <queue>
#include <render/texture/TextureInfo.hpp>
#include <string>
#include <unordered_map>
#include <util/StringHash.hpp>

// 字符字形
struct CharacterGlyph {
    // 字符字形的详细信息
    TextureInfo character_texinfo;
    char32_t c;
    // 基线偏移
    // bearingX	face->glyph->bitmap_left
    // 水平距离，即位图相对于原点的水平位置（像素）
    // bearingY	face->glyph->bitmap_top
    // 垂直距离，即位图相对于基准线的垂直位置（像素）
    glm::vec2 bearing;
    // 水平步进
    // 水平预留值，即原点到下一个字形原点的水平距离（单位：1/64像素）
    uint32_t xadvance;
};

// 字符包
struct CharacterPack {
    // 这个字符包的像素大小
    uint32_t font_size;

    // 字符位图集(unicode)
    std::unordered_map<char32_t, CharacterGlyph> character_set;
};

class FontPool {
   public:
    // 构造FontPool
    explicit FontPool(QOpenGLFunctions_4_1_Core* gl_functions);
    // 析构FontPool
    virtual ~FontPool();

    // 是否需要更新
    bool needupdate() const { return need_update.load(); };

    // 载入字体
    void load_font(std::string_view font_path, bool is_qrc);

    // 从主线程调用，处理已从磁盘加载完成的纹理，将其上传到GPU
    void processUploadQueue();

    // 获取字符信息以供渲染器使用
    std::optional<CharacterGlyph> get(std::string_view family, size_t font_size,
                                      char32_t character) const;

   private:
    QOpenGLFunctions_4_1_Core* glf;

    // 每层的固定尺寸
    const glm::vec2 LAYER_SIZE{256.f, 256.f};

    // 创建常用中文字符串
    const std::u32string cjkstr{
        U" \\!\"#$%&'()*+,-./"
        U"0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`"
        U"abcdefghijklmnopqrstuvwxyz{|}~"
        U"一乙二十丁厂七卜人入八九几儿了力乃刀又三于干亏士工土才寸下大丈与万上"
        U"小"
        U"口巾山千乞川亿个勺久凡及夕丸么广亡门义之尸弓己已子卫也女飞刃习叉马乡"
        U"丰"
        U"王井开夫天无元专云扎艺木五支厅不太犬区历尤友匹车巨牙屯比互切瓦止少日"
        U"中"
        U"冈贝内水见午牛手毛气升长仁什片仆化仇币仍仅斤爪反介父从今凶分乏公仓月"
        U"氏"
        U"勿欠风丹匀乌凤勾文六方火为斗忆订计户认心尺引丑巴孔队办以允予劝双书幻"
        U"玉"
        U"刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石布龙平灭轧东卡北占"
        U"业"
        U"旧帅归且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘付仗代仙们仪"
        U"白"
        U"仔他斥瓜乎丛令用甩印乐句匆册犯外处冬鸟务包饥主市立闪兰半汁汇头汉宁穴"
        U"它"
        U"讨写让礼训必议讯记永司尼民出辽奶奴加召皮边发孕圣对台矛纠母幼丝式刑动"
        U"扛"
        U"寺吉扣考托老执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西压厌在有百存"
        U"而"
        U"页匠夸夺灰达列死成夹轨邪划迈毕至此贞师尘尖劣光当早吐吓虫曲团同吊吃因"
        U"吸"
        U"吗屿帆岁回岂刚则肉网年朱先丢舌竹迁乔伟传乒乓休伍伏优伐延件任伤价份华"
        U"仰"
        U"仿伙伪自血向似后行舟全会杀合兆企众爷伞创肌朵杂危旬旨负各名多争色壮冲"
        U"冰"
        U"庄庆亦刘齐交次衣产决充妄闭问闯羊并关米灯州汗污江池汤忙兴宇守宅字安讲"
        U"军"
        U"许论农讽设访寻那迅尽导异孙阵阳收阶阴防奸如妇好她妈戏羽观欢买红纤级约"
        U"纪"
        U"驰巡寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝"
        U"均"
        U"抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜材村杏"
        U"极"
        U"李杨求更束豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮"
        U"男"
        U"困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利秃秀私每兵估体何但伸作伯伶佣"
        U"低"
        U"你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟免狂犹角删条卵岛迎饭饮"
        U"系"
        U"言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧"
        U"快"
        U"完宋宏牢究穷灾良证启评补初社识诉诊词译君灵即层尿尾迟局改张忌际陆阿陈"
        U"阻"
        U"附妙妖妨努忍劲鸡驱纯纱纳纲驳纵纷纸纹纺驴纽奉玩环武青责现表规抹拢拔拣"
        U"担"
        U"坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若茂苹苗英范"
        U"直"
        U"茄茎茅林枝杯柜析板松枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻"
        U"轰"
        U"顷转斩轮软到非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏"
        U"呢"
        U"岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨"
        U"佩"
        U"货依的迫质欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥服胁周"
        U"昏"
        U"鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废净盲放刻育闸闹郑券卷单炒炊炕"
        U"炎"
        U"炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审宙官"
        U"空"
        U"帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕降限妹姑姐"
        U"姓"
        U"始驾参艰线练组细驶织终驻驼绍经贯奏春帮珍玻毒型挂封持项垮挎城挠政赴赵"
        U"挡"
        U"挺括拴拾挑指垫挣挤拼挖按挥挪某甚革荐巷带草茧茶荒茫荡荣故胡南药标枯柄"
        U"栋"
        U"相查柏柳柱柿栏树要咸威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省"
        U"削"
        U"尝是盼眨哄显哑冒映星昨畏趴胃贵界虹虾蚁思蚂虽品咽骂哗咱响哈咬咳哪炭峡"
        U"罚"
        U"贱贴骨钞钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿段便俩贷顺修保促侮"
        U"俭"
        U"俗俘信皇泉鬼侵追俊盾待律很须叙剑逃食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨急"
        U"饶"
        U"蚀饺饼弯将奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送类迷前首"
        U"逆"
        U"总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋洲浑浓津恒恢恰恼恨举觉宣室宫"
        U"宪"
        U"突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩除险院娃姥姨姻娇怒架"
        U"贺"
        U"盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶"
        U"起"
        U"盐捎捏埋捉捆捐损都哲逝捡换挽热恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥"
        U"桃"
        U"格校核样根索哥速逗栗配翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌虑监紧党"
        U"晒"
        U"眠晓鸭晃晌晕蚊哨哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积"
        U"秧"
        U"秩称秘透笔笑笋债借值倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹"
        U"爱"
        U"颂翁脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆衰高席准座脊症病疾疼疲效离唐资凉"
        U"站"
        U"剖竞部旁旅畜阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴浮流润"
        U"浪"
        U"浸涨烫涌悟悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥课谁调冤谅谈"
        U"谊"
        U"剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验继球理捧堵描域掩捷排掉堆推掀"
        U"授"
        U"教掏掠培接控探据掘职基著勒黄萌萝菌菜萄菊萍菠营械梦梢梅检梳梯桶救副票"
        U"戚"
        U"爽聋袭盛雪辅辆虚雀堂常匙晨睁眯眼悬野啦晚啄距跃略蛇累唱患唯崖崭崇圈铜"
        U"铲"
        U"银甜梨犁移笨笼笛符第敏做袋悠偿偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚"
        U"脖"
        U"脸脱象够猜猪猎猫猛馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着盖粘粗粒"
        U"断"
        U"剪兽清添淋淹渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸"
        U"谜"
        U"逮敢屠弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸绿琴斑替款堪搭塔越趁趋超提堤博"
        U"揭"
        U"喜插揪搜煮援裁搁搂搅握揉斯期欺联散惹葬葛董葡敬葱落朝辜葵棒棋植森椅椒"
        U"棵"
        U"棍棉棚棕惠惑逼厨厦硬确雁殖裂雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景"
        U"践"
        U"跌跑遗蛙蛛蜓喝喂喘喉幅帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税"
        U"筐"
        U"等筑策筛筒答筋筝傲傅牌堡集焦傍储奥街惩御循艇舒番释禽腊脾腔鲁猾猴然馋"
        U"装"
        U"蛮就痛童阔善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富"
        U"窜"
        U"窝窗遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘瑞魂肆摄摸填搏塌鼓摆"
        U"携"
        U"搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆楼概赖酬感碍碑碎碰碗碌雷零"
        U"雾"
        U"雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯"
        U"矮"
        U"辞稠愁筹签简毁舅鼠催傻像躲微愈遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈"
        U"煤"
        U"煌满漠源滤滥滔溪溜滚滨粱滩慎誉塞谨福群殿辟障嫌嫁叠缝缠静碧璃墙撇嘉摧"
        U"截"
        U"誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗嗽蜻蜡蝇蜘赚锹锻舞稳"
        U"算"
        U"箩管僚鼻魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢"
        U"寨"
        U"赛察蜜谱嫩翠熊凳骡缩慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒"
        U"题"
        U"暴瞎影踢踏踩踪蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩颜毅糊遵潜"
        U"潮"
        U"懂额慰劈操燕薯薪薄颠橘整融醒餐嘴蹄器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃"
        U"澡"
        U"激懒壁避缴戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤鞭覆蹦镰翻鹰警攀蹲颤"
        U"瓣"
        U"爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐匕刁丐歹戈夭仑讥冗邓艾夯凸卢叭叽皿凹囚"
        U"矢"
        U"乍尔冯玄邦迂邢芋芍吏夷吁吕吆屹廷迄臼仲伦伊肋旭匈凫妆亥汛讳讶讹讼诀弛"
        U"阱"
        U"驮驯纫玖玛韧抠扼汞扳抡坎坞抑拟抒芙芜苇芥芯芭杖杉巫杈甫匣轩卤肖吱吠呕"
        U"呐"
        U"吟呛吻吭邑囤吮岖牡佑佃伺囱肛肘甸狈鸠彤灸刨庇吝庐闰兑灼沐沛汰沥沦汹沧"
        U"沪"
        U"忱诅诈罕屁坠妓姊妒纬玫卦坷坯拓坪坤拄拧拂拙拇拗茉昔苛苫苟苞茁苔枉枢枚"
        U"枫"
        U"杭郁矾奈奄殴歧卓昙哎咕呵咙呻咒咆咖帕账贬贮氛秉岳侠侥侣侈卑刽刹肴觅忿"
        U"瓮"
        U"肮肪狞庞疟疙疚卒氓炬沽沮泣泞泌沼怔怯宠宛衩祈诡帚屉弧弥陋陌函姆虱叁绅"
        U"驹"
        U"绊绎契贰玷玲珊拭拷拱挟垢垛拯荆茸茬荚茵茴荞荠荤荧荔栈柑栅柠枷勃柬砂泵"
        U"砚"
        U"鸥轴韭虐昧盹咧昵昭盅勋哆咪哟幽钙钝钠钦钧钮毡氢秕俏俄俐侯徊衍胚胧胎狰"
        U"饵"
        U"峦奕咨飒闺闽籽娄烁炫洼柒涎洛恃恍恬恤宦诫诬祠诲屏屎逊陨姚娜蚤骇耘耙秦"
        U"匿"
        U"埂捂捍袁捌挫挚捣捅埃耿聂荸莽莱莉莹莺梆栖桦栓桅桩贾酌砸砰砾殉逞哮唠哺"
        U"剔"
        U"蚌蚜畔蚣蚪蚓哩圃鸯唁哼唆峭唧峻赂赃钾铆氨秫笆俺赁倔殷耸舀豺豹颁胯胰脐"
        U"脓"
        U"逛卿鸵鸳馁凌凄衷郭斋疹紊瓷羔烙浦涡涣涤涧涕涩悍悯窍诺诽袒谆祟恕娩骏琐"
        U"麸"
        U"琉琅措捺捶赦埠捻掐掂掖掷掸掺勘聊娶菱菲萎菩萤乾萧萨菇彬梗梧梭曹酝酗厢"
        U"硅"
        U"硕奢盔匾颅彪眶晤曼晦冕啡畦趾啃蛆蚯蛉蛀唬唾啤啥啸崎逻崔崩婴赊铐铛铝铡"
        U"铣"
        U"铭矫秸秽笙笤偎傀躯兜衅徘徙舶舷舵敛翎脯逸凰猖祭烹庶庵痊阎阐眷焊焕鸿涯"
        U"淑"
        U"淌淮淆渊淫淳淤淀涮涵惦悴惋寂窒谍谐裆袱祷谒谓谚尉堕隅婉颇绰绷综绽缀巢"
        U"琳"
        U"琢琼揍堰揩揽揖彭揣搀搓壹搔葫募蒋蒂韩棱椰焚椎棺榔椭粟棘酣酥硝硫颊雳翘"
        U"凿"
        U"棠晰鼎喳遏晾畴跋跛蛔蜒蛤鹃喻啼喧嵌赋赎赐锉锌甥掰氮氯黍筏牍粤逾腌腋腕"
        U"猩"
        U"猬惫敦痘痢痪竣翔奠遂焙滞湘渤渺溃溅湃愕惶寓窖窘雇谤犀隘媒媚婿缅缆缔缕"
        U"骚"
        U"瑟鹉瑰搪聘斟靴靶蓖蒿蒲蓉楔椿楷榄楞楣酪碘硼碉辐辑频睹睦瞄嗜嗦暇畸跷跺"
        U"蜈"
        U"蜗蜕蛹嗅嗡嗤署蜀幌锚锥锨锭锰稚颓筷魁衙腻腮腺鹏肄猿颖煞雏馍馏禀痹廓痴"
        U"靖"
        U"誊漓溢溯溶滓溺寞窥窟寝褂裸谬媳嫉缚缤剿赘熬赫蔫摹蔓蔗蔼熙蔚兢榛榕酵碟"
        U"碴"
        U"碱碳辕辖雌墅嘁踊蝉嘀幔镀舔熏箍箕箫舆僧孵瘩瘟彰粹漱漩漾慷寡寥谭褐褪隧"
        U"嫡"
        U"缨撵撩撮撬擒墩撰鞍蕊蕴樊樟橄敷豌醇磕磅碾憋嘶嘲嘹蝠蝎蝌蝗蝙嘿幢镊镐稽"
        U"篓"
        U"膘鲤鲫褒瘪瘤瘫凛澎潭潦澳潘澈澜澄憔懊憎翩褥谴鹤憨履嬉豫缭撼擂擅蕾薛薇"
        U"擎"
        U"翰噩橱橙瓢蟥霍霎辙冀踱蹂蟆螃螟噪鹦黔穆篡篷篙篱儒膳鲸瘾瘸糙燎濒憾懈窿"
        U"缰"
        U"壕藐檬檐檩檀礁磷了瞬瞳瞪曙蹋蟋蟀嚎赡镣魏簇儡徽爵朦臊鳄糜癌懦豁臀藕藤"
        U"瞻"
        U"嚣鳍癞瀑襟璧戳攒孽蘑藻鳖蹭蹬簸簿蟹靡癣羹鬓攘蠕巍鳞糯譬霹躏髓蘸镶瓤"
        U"矗"};

    // 需要更新(gpu)
    std::atomic<bool> need_update{true};

    // 载入的字符bitmap原始数据
    struct LoadedImageData {
        std::string family;
        // 字符大小
        uint32_t size;
        // 字符
        char32_t c;
        // 在纹理集合中需要占用的尺寸
        int width;
        int height;
        // 原始bitmap数据
        unsigned char* data;

        glm::ivec2 bearing;
        uint32_t xadvance;
    };

    void clear();

    void uploadToGpu(const LoadedImageData& data);

    // 异步载入纹理或分配大显存的线程池
    ice::ThreadPool threadpool{4};
    std::atomic<bool> is_running{true};

    // 生产者-消费者队列，用于在工作线程和主线程间传递数据
    std::queue<LoadedImageData> upload_queue;
    mutable std::mutex queue_mutex;
    std::condition_variable cv;

    // 存储所有字体包映射
    // [fontfamily-[字符大小-字形包]]
    std::unordered_map<std::string, std::unordered_map<uint32_t, CharacterPack>,
                       StringHash, std::equal_to<>>
        character_infos;
    // 所有纹理组的信息
    std::unordered_map<uint32_t, AtlasGroup> groups;
    mutable std::mutex info_mutex;

    // 纹理数组(Texture Array)成员
    int32_t max_texture_array_layers{0};

    // 追踪当前字形打包位置的状态
    std::atomic<uint32_t> current_atlas_id = 0;
    std::atomic<uint32_t> current_layer_index = 0;
    std::atomic<float> cursor_x = 0.0f;
    std::atomic<float> cursor_y = 0.0f;
    std::atomic<float> current_line_height = 0.0f;
};
#endif  // MMM_FONTPOOL_HPP
